app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `created_at`, `updated_at`, `login`, `password`, `email`) VALUES('Rodrigo', '2009-06-01 20:21:49', '2009-06-01 20:21:49', 'rodrigofabaro', '12345', 'rodrigo.engenharia@gmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def update
    @user = User.find(params[:id])